#pragma once
#include <Diablo/Core/AuctionInterface.hpp>
#include <Diablo/Core/Trainer.hpp>
#include <Diablo/Core/Support.hpp>

namespace Diablo
{
    // local
    //------------------------------------------------------------------------
    static const ULong  _DROPDOWN_STRING_LIMIT =    64;

    static const Char*  _D3_MODULE =                "Diablo III.exe";
    static const Char*  _BNET_MODULE =              "battle.net.dll";

    static const Char*  _HINT_DROPDOWN =            "Root.TopLayer.DropDown";
    static const Char*  _HINT_DROPDOWNCONTENT =     "Root.TopLayer.DropDown._content";
    static const Char*  _HINT_DROPDOWNCONTENTSTACK ="Root.TopLayer.DropDown._content._stackpanel";

    static const Char   _FORMAT_COMBO_TEXT[] =      "{c:%s}%s{/c}";
    static const Char   _FORMAT_ITEM_NAME[] =       "{C:%s}%s{/C}";
    static const Char   _FORMAT_ITEM_RARITYTYPE[] = "{c:%s}%s %s{/c}";
    static const Char   _FORMAT_SOCKET_EMPTY[] =    "{c_bonus}%s{/c}";
    static const Char*  _FORMAT_SOCKET_GEM =        "{icon:bullet} %s\n";
    static const Char*  _FORMAT_STAT[] = {
        "{icon:bullet} {c:%s}%s{c:ffff0000}%s{/c}{/c}\n",
        "{icon:bullet} {c:%s}%s{/c}\n",
        "{c:%s}{icon:bullet}%s{c:ffff0000}%s{/c}{/c}\n",
        "{c:%s}{icon:bullet}%s{/c}\n",
    };

    static const Char*  _HINT_LISTITEM_ITEM =       "D3_ITEM";
    static const Char*  _HINT_UIOBJECT_PATH[Trainer::OBJECT_COUNT] =
    {

        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.MenuContentContainer.SearchMenu.SearchMenuContent.SearchItemListContent.EquipmentSearch.SearchStatsFilterList.slot 5 list.AdvancedFilterTextBox",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.MenuContentContainer.SearchMenu.SearchMenuContent.SearchItemListContent.EquipmentSearch.UniqueItemTextBox",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.MenuContentContainer.SearchMenu.SearchMenuContent.SearchItemListContent.EquipmentSearch.BuyoutTextBox",

        "Root.TopLayer.item 2.stack.frame body.stack.stats",
        "Root.TopLayer.item 2.stack.frame body.stack.main.large_itembutton",
        "Root.TopLayer.item 2.stack.frame body.stack.socket 0.text",
        "Root.TopLayer.item 2.stack.frame body.stack.socket 1.text",
        "Root.TopLayer.item 2.stack.frame body.stack.socket 2.text",
        "Root.TopLayer.item 2.stack.top_wrapper.stack.name",

        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.TabContentContainer.SearchTabContent.SearchListContent.SearchItemList.PagingButtonsContainer.PageRightButton",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.MenuContentContainer.SearchMenu.SearchMenuContent.SearchItemListContent.SearchButton",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.MenuContentContainer.CompletedMenu.CompletedMenuContainer.CompletedItemContainer.CompletedItemSendToButton",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.TabContentContainer.SearchTabContent.SearchListContent.SearchBuyoutButton",

        "Root.TopLayer",
        "Root.TopLayer.BattleNetLightBox_main.LayoutRoot.LightBox",
        "Root.NormalLayer.BattleNetAuctionHouse_main.LayoutRoot.OverlayContainer.PageHeader",
    };

    /*
        1 d3 search with buyout
        2 mem search 4byte buyout of item in row 1
        3 goto next page and compare to buyout in row 1 until unique
        4 pointer (re)scan address found. static only. levels=4. offset=1024.
        5 with pointer scan still open restart d3 goto 1
    */
    static const Process::Link _chain_searchresults[] = { 0x00F75DF8, 0x00000000 }; // _D3_MODULE
    static const Process::Chain _CHAIN_SEARCHRESULTS(_chain_searchresults, ACOUNT(_chain_searchresults));

    /*
        1 set low frame rate
        2 mem search 4byte between estimated frames passed
        3 mem research incrementing
        4 keep only static addresses
        5 ensure valid in world, menus, and AH
        6 restart d3 goto 2
    */
    static const ULong _BASEADDRESS_FRAMECOUNT =   0x00FC90FC; // _D3_MODULE
    /*
        1 login and mem search 4byte = 1
        2 logout and mem search 4byte = 0
        3 keep only static address
        4 ensure value = 1 in world, menus, and AH
        5 restart d3 goto 1
    */
    static const ULong _BASEADDRESS_LOGGEDIN =     0x007132F4; // _BNET_MODULE

    //------------------------------------------------------------------------
    struct _UiObjectChild
    {
        Byte    _1      [0x04];
        ULong   addr_target2;       // 004
        ULong   addr_target3;       // 008
    };

    struct _UiHoverHeader
    {
        Byte    _1      [0x50];
        Char    raretype[0x28];     // 050
        Char    dpsarmor[0x20];     // 078
    };

    struct _UiHoverStats
    {
        Char    text    [0x400];    // 000
    };

    struct _UiHoverName
    {
        Char    text    [0x80];    // 000
    };

    struct _UiHoverSocket
    {
        Char    text    [0x060];    // 000
    };

    struct _UiInputText
    {
        Char    text    [0x040];    // 000
    };

    struct _AhListItem              // 118
    {
        Byte    _1      [0x024];
        Char    d3item  [0x008];    // 024
        Byte    _2      [0x064];
        Char    d3gold  [0x008];    // 090
        Byte    _3      [0x028];
        ULong   id;                 // 0C0
        Byte    _4      [0x00c];
        ULong   bid1;               // 0D0
        Byte    _5      [0x004];
        ULong   buyout;             // 0D8
        Byte    _6      [0x004];
        ULong   bid2;               // 0E0
        Byte    _7      [0x01c];
        UHuge   time;               // 100
        Byte    _8      [0x010];
    };


    // public
    //------------------------------------------------------------------------
    Trainer::Trainer( Process& process ):
        _process(process),
        _memory(process),
        _d3_base(0),
        _bnet_base(0),
        _combo_count(0),
        _trained(false)
    {
        assert(_DROPDOWN_STRING_LIMIT <= sizeof(TextString));
    }

    //------------------------------------------------------------------------
    Bool Trainer::Train( Bool partial )
    {
        Tools::MemZero(_address, ACOUNT(_address));
        _trained = false;

        // get base addresses
        if((_d3_base = _process.GetBaseAddress(_D3_MODULE)) == 0)
            return false;
        if((_bnet_base = _process.GetBaseAddress(_BNET_MODULE)) == 0)
            return false;

        // scan memory
        if(_memory.Scan(*this))
        {
            Index i;

            // verify all addresses
